import React from "react";
import { BrowserRouter as Router, Routes, Route } from "react-router-dom";
import Navbar from "./components/Navbar";
import Home from "./pages/Home";
// import IncomeExpense from "./pages/IncomeExpense";
import Reports from "./pages/Reports";
import NotFound from "./pages/NotFound";
import InfoProduct from "./pages/InfoProduct/InfoProduct";
import InfoSizes from "./pages/InfoSizes";
import IncomeExpense from "./pages/IncomeExpense";
// import Header from "./components/Header";

function App() {
  return (
    <Router>
      <div className="min-h-screen">
        {/* <Header/> */}
        <Navbar />
        <div className="  mt-4">
          <Routes>
            <Route path="/" element={<Home />} />
            <Route path="/income-expense" element={<IncomeExpense />} />
            <Route path="/reports" element={<Reports />} />
            <Route path="/info/clothings" element={<InfoProduct />} />
            <Route path="/info/sizes" element={<InfoSizes/>} />
            <Route path="/info/clothing-groups" element={<h1>Groups</h1>} />
            {/* Add more routes as needed */}
            <Route path="*" element={<NotFound />} />
          </Routes>
        </div>
      </div>
    </Router>
  );
}

export default App;

// {
//   "Бош саҳифа": "",
//   "Кирим-чиқим": "",
//   "Ҳисоботлар": "",
//   "Маълумотлар": "",
//   "Кийимлар": "",
//   "Ўлчамлар": "",
//   "Кийим гуруҳлари": "",
//   "Фарманов Омарбек Бахтиёрович": "",
//   "Қумита масъул ходими": "",
//   "Чиқиш": "",
//   "Жами ходимлар": "",
//   "Муддати келган": "",
//   "Янги ходимлар": "",
//   "Ротация": "",
//   "Муддати яқин": "",
//   "Берилганлар": "",
//   "Ашёвий таъминот номи": "",
//   "Ўлчами": "",
//   "Миқдори": "",
//   "Муддати (йилда)": "",
//   "Берилган сана": "",
//   "Ҳолати": "",
//   "Қолди": "",
//   "йил": "",
//   "Берилди": "",
//   "Изоҳ": "",
//   "Берилган": "",
//   "7 йил": "",
//   "Фуражка (аёллар учун пилотка), кокардаси билан": "",
//   "0 кун": "",
//   "Аск бўйича сортлаш": "",
//   "Деск бўйича сортлаш": "",
//   "Сортлашни бекор қилиш": "",
//   "Фильтрлаш": "",
//   "Ушбу устунни яшириш": "",
//   "Устунларни кўрсатиш": "",
//   "Устунни топиш": "",
//   "Устун сарлавҳаси": "",
//   "Барчасини кўрсатиш": "",
//   "Барчасини яшириш": "",
//   "Жами қаторлар:": "",
//   "Саҳифадаги қаторлар:": "",
//   "1 қатор танланган": "",
//   "қатор танланган": "",
//   "Устунлар": "",
//   "Фильтрлар": "",
//   "Зичлик": "",
//   "Экспорт": "",
//   "Фильтр қўшиш": "",
//   "Ўчириш": "",
//   "Операторлар": "",
//   "Ва": "",
//   "Ёки": "",
//   "Қиймат": "",
//   "Маълумотлар топилмади": "",
//   "Ф.И.Ш": "",
//   "Лавозими ва унвони": "",
//   "Тузилма номи": "",
//   "Пост номи": "",
//   "Формали кийим-бош": "",
//   "Ички кийим": "",
//   "Оёқ кийим": "",
//   "Мақоми": "",
//   "Ҳаракатлар": "",
//   "Телпак қоракўлдан (кубанка аёллар учун), кокардаси билан": "",
//   "Ходимларни Ашёвий таъминотлар билан таъминлаш рўйхати": "",
//   "БК марказий аппарат": "",
//   "Пост": "",
//   "Барчаси...": "",
//   "дан": "",
//   "гача": "",
//   "Қидирув": "",
//   "БЕРИЛИШ МУДДАТИ КЕЛГАН ФОРМАЛИ КИЙИМ-БОШ РЎЙХАТИ": "",
//   "Бекор қилиш": "",
//   "Сақлаш ва жўнатиш": "",
//   "Жами ашёвий таъминот": "",
//   "180 минг дона": "",
//   "160,2 млрд": "",
//   "млрд": "",
//   "Фойдаланишда": "",
//   "112 минг дона": "",
//   "Захирада": "",
//   "68 минг дона": "",
//   "54,9 млрд": "",
//   "Ишдан бўшатилганлар": "",
//   "68 та": "",
//   "млн сўм": "",
//   "Юк хати рақами": "",
//   "Юк хати санаси": "",
//   "Кимдан": "",
//   "Кимга": "",
//   "Сони": "",
//   "Жами": "",
//   "Куртка қишки": "",
//   "Кирим": "",
//   "Божхона қўмитаси": "",
//   "Фуражка (аёллар учун пилотка)": "",
//   "Камайиш бўйича сортлаш": "",
//   "Устунларни бошқариш": "",
//   "бешдан кўп": "",
//   "Биринчи саҳифа": "",
//   "Олдинги саҳифа": "",
//   "Кейинги саҳифа": "",
//   "Охирги саҳифа": "",
//   "минг дона": "",
//   "та": "",
//   "Ундирилган пул маблағлари": "",
//   "Жами ашёвий таъминотлар рўйхати": "",
//   "Тошкент вилояти": "",
//   "Андижон вилояти": "",
//   "Яллама ЧБП": "",
//   "Чирчиқ ЧБП": "",
//   "Чиқим": "",
//   "Қидирув...": "",
//   "Кийимни таҳрирлаш": "",
//   "Кийим киритиш": "",
//   "Кийим номи (лотин тилида)": "",
//   "Илтимос, фақат лотин ҳарфлари киритинг.": "",
//   "Кийим номи (кирилл тилида)": "",
//   "Кийим тури": "",
//   "Кийим Нархи": "",
//   "Холат": "",
//   "фаол": "",
//   "нофаол": "",
//   "Танланг...": "",
//   "Улчов бирлиги": "",
//   "КИРИТИШ": "",
//   "Жами маҳсулотлар": "",
//   "Фаол маҳсулотлар": "",
//   "нофаол маҳсулотлар": "",
//   "Уникал турлар": "",
//   "Узб тили": "",
//   "Рус тили": "",
//   "Тури": "",
//   "Нархи": "",
//   "Олчов бирлиги": "",
//   "Холати": "",
//   "Фаол": "",
//   "Таҳрирлаш": "",
//   "Бу ерда маҳсулотларни бошқаришингиз мумкин": "",
//   "Номи": "",
//   "Барчаси": "",
//   "Нархи (дана)": "",
//   "Нархи (гача)": "",
//   "Ўлчамни таҳрирлаш": "",
//   "Ўлчам киритиш": "",
//   "Ўлчам номи (лотин тилида)": "",
//   "Ўлчам номи (рус тилида)": "",
//   "Қандай кийим турлари учун?": "",
//   "Бу ерда сиз улчамларни бошқаришингиз мумкин": "",
//   "Саҳифа топилмади": ""
// }
